{
  "uuid": "",
  "id": "2018_Leibovich_Model_for_Renal_Cell_Carcinoma.v0.0.1",
  "gdl_version": "2.1",
  "concept": "gt0001",
  "language": {
    "original_language": "ISO_639-1::en"
  },
  "description": {
    "original_author": {
      "name": "Katja Mariko Wilde",
      "email": "katja-wilde@t-online.de",
      "organisation": "Cambio CDS",
      "date": "2025-09-24"
    },
    "lifecycle_state": "DRAFTED",
    "details": {
      "en": {
        "id": "en",
        "purpose": "To calculate the total sum for the 2018 Leibovich model in clear cell RCC (ccRCC), or to allocate risk groups in papillary RCC (papRCC) and chromophobe RCC (chrRCC), in order to assess prognosis for progression-free survival (PFS) and cancer-specific survival (CSS) in adult patients with renal cell carcinoma (RCC).",
        "keywords": [
          "Leibovich model",
          "RCC",
          "renal",
          "cell",
          "carcinoma"
        ],
        "use": "Use to assess prognosis in adult patients with renal cell carcinoma (RCC), including clear cell RCC (ccRCC), papillary RCC (papRCC), and chromophobe RCC (chrRCC).\n\nFor ccRCC, the model assigns points to clinical and pathological variables (age at surgery, ECOG status, constitutional symptoms, adrenalectomy, surgical margins, tumor grade, coagulative necrosis, sarcomatoid differentiation, tumor size, perinephric/renal sinus fat invasion, tumor thrombus, extension beyond the kidney, and nodal involvement). The total points are used to estimate PFS and CSS probabilities at 5, 10, and 15 years.\n\nFor papRCC, classification is based on tumor grade, perinephric/renal sinus fat invasion, and tumor thrombus. Patients are allocated into prognostic risk groups, each linked to predicted PFS and CSS probabilities at 5, 10, and 15 years.\n\nFor chrRCC, classification is based on sarcomatoid differentiation, perinephric/renal sinus fat invasion, and nodal involvement. Patients are allocated into prognostic risk groups, each linked to predicted PFS and CSS probabilities at 5, 10, and 15 years.",
        "misuse": "Not to be used for recording information related to other renal cell carcinoma prognostic models.",
        "copyright": "© Cambio CDS"
      }
    },
    "other_details": {
      "references": "Leibovich BC, Lohse CM, Cheville JC, Zaid HB, Boorjian SA, Frank I, Thompson RH, Parker WP. Predicting Oncologic Outcomes in Renal Cell Carcinoma After Surgery. Eur Urol. 2018 May;73(5):772-780. doi: 10.1016/j.eururo.2018.01.005. Epub 2018 Feb 3. PMID: 29398265.",
      "en": "An assessment score used to predict progression-free and cancer-specific survival in patients with renal cell carcinoma (RCC)."
    }
  },
  "definition": {},
  "ontology": {
    "term_definitions": {
      "en": {
        "id": "en",
        "terms": {
          "gt0001": {
            "id": "gt0001",
            "text": "2018 Leibovich Model for Renal Cell Carcinoma",
            "description": "An assessment score used to predict progression-free and cancer-specific survival in patients with renal cell carcinoma (RCC)."
          }
        }
      }
    }
  }
}