{
  "uuid": "",
  "id": "BALL_Score.v0.0.1-draft",
  "gdl_version": "2.1",
  "concept": "gt0001",
  "language": {
    "original_language": "ISO_639-1::en"
  },
  "description": {
    "original_author": {
      "name": "Kevin Arjona",
      "email": "kevin.arjona@cambio.se",
      "organisation": "Cambio CDS",
      "date": "2025-08-05"
    },
    "lifecycle_state": "DRAFTED",
    "details": {
      "en": {
        "id": "en",
        "purpose": "To calculate the BALL score and predict complete response rate based on the recorded clinical parameters.",
        "keywords": [
          "prognosis",
          "calculation",
          "leukemia",
          "cll",
          "score",
          "ball",
          "chemoimmunotherapy",
          "relapsed",
          "refractory"
        ],
        "use": "In patients with relapsed or refractory Chronic Lymphocytic Leukemia (CLL) to support treatment decisions.",
        "misuse": "Not to be used for initial diagnosis of CLL, staging, or for predicting response to novel agents (e.g., BTK inhibitors, BCL-2 inhibitors).",
        "copyright": "© Cambio CDS"
      }
    },
    "other_details": {
      "references": "Soumerai JD, Ni A, Darif M, Londhe A, Xing G, Mun Y, Kay NE, Shanafelt TD, Rabe KG, Byrd JC, Chanan-Khan AA, Furman RR, Hillmen P, Jones J, Seymour JF, Sharman JP, Ferrante L, Mobasher M, Stark T, Reddy V, Dreiling LK, Bhargava P, Howes A, James DF, Zelenetz AD. Prognostic risk score for patients with relapsed or refractory chronic lymphocytic leukaemia treated with targeted therapies or chemoimmunotherapy: a retrospective, pooled cohort study with external validations. Lancet Haematol. 2019 Jul;6(7):e366-e374. doi: 10.1016/S2352-3026(19)30085-7. Epub 2019 May 17. Erratum in: Lancet Haematol. 2019 Jul;6(7):e348. doi: 10.1016/S2352-3026(19)30116-4. PMID: 31109827; PMCID: PMC6620111.\n\nMolica S, Baumann TS, Lentini M, Levato L, Delgado J, Montserrat E. The BALL prognostic score identifies relapsed/refractory CLL patients who benefit the most from single-agent ibrutinib therapy. Leuk Res. 2020 Aug;95:106401. doi: 10.1016/j.leukres.2020.106401. Epub 2020 Jun 10. PMID: 32562875.",
      "en": "Calculates the BALL score and provides the corresponding estimated probability of complete response to chemoimmunotherapy."
    }
  },
  "definition": {},
  "ontology": {
    "term_definitions": {
      "en": {
        "id": "en",
        "terms": {
          "gt0001": {
            "id": "gt0001",
            "text": "BALL Score",
            "description": "Calculates the BALL score and provides the corresponding estimated probability of complete response to chemoimmunotherapy."
          }
        }
      }
    }
  }
}