{"uuid": "298a90c7-853a-4cf7-9dc6-2d731086f56f", "id": "bmi.v0", "gdl_version": "2.1", "concept": "gt0001", "language": {"original_language": "ISO_639-1::en"}, "description": {"original_author": {"name": "prat", "email": "rustogi.pratibha@gmail.com", "organisation": "cambio"}, "lifecycle_state": "DRAFTED", "details": {"en": {"id": "en", "purpose": "Body Mass Index (BMI) is a simple and widely used screening tool that helps assess a person's nutritional status and potential health risks based on their weight in relation to their height. It is calculated using the formula BMI = weight (kg) / height² (m²) and classifies individuals into categories such as underweight, normal weight, overweight, and various levels of obesity. ", "use": "The primary use of BMI is to identify individuals who may be at risk for health conditions such as cardiovascular disease, type 2 diabetes, hypertension, and certain cancers. It is also useful for monitoring changes in weight over time, supporting clinical decisions, and facilitating discussions between healthcare providers and patients about lifestyle and dietary choices. ", "misuse": "BMI does not differentiate between muscle, fat, or bone mass, making it unreliable for individuals with high muscle mass, such as athletes, who may be incorrectly classified as overweight or obese. It also fails to account for fat distribution, which is a more accurate predictor of health risks like cardiovascular disease. Additionally, BMI does not consider age, gender, or ethnic differences, which can affect body composition and associated risks. Relying solely on BMI may contribute to weight-related stigma and misclassification, potentially leading to inappropriate medical advice or overlooked health concerns."}}, "other_details": {"en": "bmi_test_sample"}}, "definition": {}, "ontology": {"term_definitions": {"en": {"id": "en", "terms": {"gt0001": {"id": "gt0001", "text": "bmi", "description": "BMI (Body Mass Index) is a value derived from a person’s weight and height. It is used as a simple screening tool to classify individuals into categories like underweight, normal weight, overweight, and obesity."}}}}}, "date": "2025-10-21", "tags": []}