{
  "uuid" : "",
  "id" : "hca_subtype_assessment.v0.0.1",
  "gdl_version" : "2.1",
  "concept" : "gt0001",
  "language" : {
    "original_language" : "ISO_639-1::en"
  },
  "description" : {
    "original_author" : {
      "name" : "Katja Mariko Wilde",
      "email" : "katja-wilde@t-online.de",
      "organisation" : "Cambio CDS",
      "date" : "2026-01-08"
    },
    "lifecycle_state" : "DRAFTED",
    "details" : {
      "en" : {
        "id" : "en",
        "purpose" : "To assess and interpret histological and immunohistochemical diagnostic patterns in order to classify hepatocellular adenoma subtype and estimate the associated risk of malignant transformation.",
        "keywords" : [
          "hepatocellular",
          "adenoma",
          "hca",
          "liver",
          "pathology",
          "diagnostic assessment"
        ],
        "use" : "Use to assess hepatocellular adenoma subtype and associated risk of malignant transformation in adult patients with available histological and immunohistochemical findings.\n\nThe assessment is performed by evaluating predefined diagnostic patterns:\n\nHistological diagnostic pattern, selected from:\n\n- lobulated contours and steatosis; often microadenomas in the surrounding liver parenchyma;\n- sinusoidal dilatation, congestion, foci of lymphocytic inflammation, thick arteries, ductular reaction, pseudoportal tracts;\n- cytoarchitectural atypia and pseudoglandular formations associated with β-catenin exon 3 mutation;\n- no specific histological features reported.\n\nImmunohistochemical diagnostic pattern, selected from:\n- loss of LFABP;\n- positivity for CRP and SAA;\n- β-catenin exon 3 (non-S45) pattern with diffuse, homogeneous GS and frequent nuclear β-catenin positivity;\n- β-catenin exon 3 S45 pattern with diffuse, heterogeneous GS (starry-sky pattern);\n- β-catenin exon 7/8 pattern with weak GS and peripheral staining;\n- positivity for PTGDS;\n- ASS1 expression associated with increased bleeding risk;\n\nBased on the selected patterns, the guideline:\n- assigns a hepatocellular adenoma subtype;\n- estimates the associated risk for hepatocellular carcinoma; and\n- identifies inconsistent pattern combinations by generating a validation message.",
        "misuse" : "Not to be used for staging or treatment planning of hepatocellular carcinoma.",
        "copyright" : "© Cambio CDS"
      }
    },
    "other_details" : {
      "references" : "Regionala cancercentrum i samverkan. Nationellt vårdprogram levercellscancer: Kapitel 9 Kategorisering av tumören. Kunskapsbanken, 2024. Available at: https://kunskapsbanken.cancercentrum.se/diagnoser/levercellscancer/vardprogram/kategorisering-av-tumoren/\n\nBioulac-Sage P, Balabaud C, Zucman-Rossi J. Subtype classification of hepatocellular adenoma. Dig Surg. 2010;27(1):39-45. doi: 10.1159/000268406. Epub 2010 Apr 1. PMID: 20357450.",
      "en" : "A structured diagnostic assessment used to interpret histological and immunohistochemical patterns in hepatocellular adenoma and to support subtype classification and risk evaluation."
    }
  },
  "definition" : { },
  "ontology" : {
    "term_definitions" : {
      "en" : {
        "id" : "en",
        "terms" : {
          "gt0001" : {
            "id" : "gt0001",
            "text" : "Hepatocellular adenoma subtype assessment",
            "description" : "A structured diagnostic assessment used to interpret histological and immunohistochemical patterns in hepatocellular adenoma and to support subtype classification and risk evaluation."
          }
        }
      }
    }
  }
}