{"id":"ISTH_SCC_bleeding_assessment_tool.v0.0.3","gdl_version":"2.1","concept":"gt0001","language":{"original_language":"ISO_639-1::en"},"description":{"original_author":{"name":"Shweta Prasad Ghaisas","email":"S.Prasad.Ghaisas@cambio.se","organisation":"Cambio CDS","date":"2025-04-16"},"lifecycle_state":"Author draft","details":{"en":{"id":"en","copyright":"© Cambio CDS","keywords":["bleeding","bleeding assessment","thrombosis","haemostasis","scientific standardization committee","international society on thrombosis and haemostasis","bleeding disorder","epistaxis","postpartum hemorrhage","gastrointestinal bleeding","hematuria","oral cavity bleeding","bleeding from minor  wounds","cutaneous bleeding","tooth extraction","bleeding from surgery ","menorrhagia","muscle hematomas","hemarthrosis","central nervous system bleeding"],"purpose":"To calculate and interpret the total score of the ISTH-SCC bleeding assessment tool.","use":"This tool assesses the presence and severity of bleeding symptoms and can serve as a screening tool to determine which patients require additional laboratory evaluation.\n\nIt has been validated in various inherited bleeding disorder populations, including von Willebrand disease, hemophilia, and platelet disorders.\n\nResults may inform the need for further diagnostic workup in patients with a suspected inherited bleeding disorder.\n- Low scores are associated with a low likelihood of a bleeding disorder, and additional evaluation may not be warranted.\n- Elevated scores indicate an increased risk of bleeding; further evaluation for an underlying inherited bleeding disorder is appropriate (e.g., laboratory studies, specialty consultation).","misuse":"The tool has been validated for use in adults and children, although sensitivity is lower in pediatric populations.\n\nIt has low sensitivity for acquired bleeding disorders.\n\nFor the calculation, only symptoms and treatment BEFORE and AT diagnosis should be considered.\n\nResults are not intended to be diagnostic but should be used as part of a comprehensive evaluation in conjunction with clinical judgment and specialty consultation."}},"other_details":{"en":"An assessment tool used to evaluate patients with a suspected inherited bleeding disorder.","references":"Rodeghiero F, et al. ISTH/SSC bleeding assessment tool: a standardized questionnaire and a proposal for a new bleeding score for inherited bleeding disorders. J Thromb Haemost. 2010 Sep;8(9):2063–5.\n\nElbatarny M, Mollah S, Grabell J, et al. Normal range of bleeding scores for the ISTH-BAT: adult and pediatric data from the merging project. Haemophilia. 2014 Nov;20(6):831–5.\n\nBorhany M, Fatima N, Abid M, Shamsi T, Othman M. Application of the ISTH bleeding score in hemophilia. Transfus Apher Sci. 2018 Aug;57(4):556–60.\n\nGresele P, Orsini S, Noris P, et al. Validation of the ISTH/SSC bleeding assessment tool for inherited platelet disorders: a communication from the Platelet Physiology SSC. J Thromb Haemost. 2020 Mar;18(3):732–9.\n\nKalot MA, Husainat N, Tayiem S, et al. Bleeding assessment tools in the diagnosis of VWD in adults and children: a systematic review and meta-analysis of test accuracy. Blood Adv. 2021 Dec 14;5(23):5023–31.\n\nRezende SM, Neumann I, Angchaisuksiri P, et al. International Society on Thrombosis and Haemostasis clinical practice guideline for treatment of congenital hemophilia A and B based on the Grading of Recommendations Assessment, Development, and Evaluation methodology. J Thromb Haemost. 2024 Sep;22(9):2629–52."},"other_contributors":[]},"definition":{"data_bindings":{},"templates":{},"rules":{}},"ontology":{"term_definitions":{"en":{"id":"en","terms":{"gt0001":{"id":"gt0001","text":"ISTH-SCC bleeding assessment tool","description":"An assessment tool which can be used to evaluate patients with a suspected inherited bleeding disorder."}}}},"term_bindings":{}}}