{
  "uuid": "",
  "id": "Prostate_Cancer_Risk_Group_Classification.v0.0.1-draft",
  "gdl_version": "2.1",
  "concept": "gt0001",
  "language": {
    "original_language": "ISO_639-1::en"
  },
  "description": {
    "original_author": {
      "name": "Kevin Arjona",
      "email": "kevin.arjona@cambio.se",
      "organisation": "Cambio CDS",
      "date": "2025-07-17"
    },
    "lifecycle_state": "DRAFTED",
    "details": {
      "en": {
        "id": "en",
        "purpose": "To automate the calculation of the prostate cancer risk group to support clinical decision-making based on the Swedish National Guidelines",
        "keywords": [
          "prostate cancer",
          "prostate",
          "cancer",
          "risk",
          "T-stage",
          "TNM",
          "Gleason score",
          "PSA"
        ],
        "use": "To be used in patients with prostate cancer without known metastasis.\n\nThe guideline will evaluate the input parameters to assign a single risk group for the patient.\n\nCheck for Very High Risk: The patient is classified as \"Very high risk\" IF EITHER of the following is true:\nT-stage is T3.\n\nOR (Gleason score is 8, 9, or 10 AND Number of positive biopsy cores with Gleason 8-10 &gt; 4).\n\nHigh Risk: If not Very High Risk, the patient is classified as \"High risk\" IF AT LEAST ONE of the following is true:\n\nT-stage is T2c.\nGleason score is 8, 9, or 10.\nPSA at diagnosis is ≥ 20 ng/mL.\n\nIntermediate Risk: If not Very High or High Risk, the patient is classified as \"Intermediate risk\" IF AT LEAST ONE of the following is true:\n\nT-stage is T2b.\nGleason score is 7 (either 3+4 or 4+3).\nPSA at diagnosis is between 10 and 19.9 ng/mL (inclusive).\n\nLow Risk: If the patient does not meet any of the criteria for Very High, High, or Intermediate risk, they are classified as \"Low risk\". This corresponds to having ALL of the following:\n\nT-stage is T1c or T2a.\nAND Gleason score is ≤ 6.\nAND PSA at diagnosis is &lt; 10 ng/mL.\n\nVery low Risk: If not low Risk, the patient is classified as \"Very low risk\" This corresponds to having ALL of the following:\n\nT1c, Gleason score 6, ≤ 8 mm cancer total in 1–4 of 8–12 systematic biopsy cores, PSA &lt; 10 µg/l and PSA density &lt; 0.15 µg/l/cm3",
        "misuse": "Not applicable if any of the required inputs are missing.",
        "copyright": "© Cambio CDS"
      }
    },
    "other_details": {
      "references": "Zumsteg ZS, Spratt DE, Pei I, Zhang Z, Yamada Y, Kollmeier M, Zelefsky MJ. A new risk classification system for therapeutic decision making with intermediate-risk prostate cancer patients undergoing dose-escalated external-beam radiation therapy. Eur Urol. 2013 Dec;64(6):895-902. doi: 10.1016/j.eururo.2013.03.033. Epub 2013 Mar 23. PMID: 23541457.\n\nGnanapragasam VJ, Bratt O, Muir K, Lee LS, Huang HH, Stattin P, Lophatananon A. The Cambridge Prognostic Groups for improved prediction of disease mortality at diagnosis in primary non-metastatic prostate cancer: a validation study. BMC Med. 2018 Feb 28;16(1):31. doi: 10.1186/s12916-018-1019-5. PMID: 29490658; PMCID: PMC5831573.\n\n",
      "en": "Applies the Swedish National Guidelines to classify localized prostate cancer into Very low, Low, Intermediate, High, or Very High risk groups based on recorded clinical parameters."
    }
  },
  "definition": {},
  "ontology": {
    "term_definitions": {
      "en": {
        "id": "en",
        "terms": {
          "gt0001": {
            "id": "gt0001",
            "text": "Prostate Cancer Risk Group Classification",
            "description": "Applies the Swedish National Guidelines to classify localized prostate cancer into Very low, Low, Intermediate, High, or Very High risk groups based on recorded clinical parameters."
          }
        }
      }
    }
  }
}